In [3]:
import pandas as pd
import numpy as np

In [19]:
df2010 = pd.read_csv('Data/s2010.tdf', sep='\t', engine='python', names=['symb', 'retdate', 'opn', 'high', 'low','cls', 'vol', 'exch'], parse_dates = ['retdate'])
df2011 = pd.read_csv( 'Data/s2011.tdf',sep='\t', engine='python', names=['symb', 'retdate', 'opn', 'high', 'low','cls', 'vol', 'exch'], parse_dates = ['retdate'])
dffnd = pd.read_csv( 'Data/fnd.tdf',sep='\t', engine='python', names=['gvkey', 'datadate', 'fyear', 'indfmr','consol', 'popsrc', 'datafmt' , 'tic', 'cusip', 'conm', 'fyr', 'cash', 'dp','ebitda', 'emp', 'invt', 'netinc', 'ppent', 'rev' , 'ui', 'cik'])

In [20]:
df2010.dtypes

symb               object
retdate    datetime64[ns]
opn               float64
high              float64
low               float64
cls               float64
vol                 int64
exch               object
dtype: object

# First Five

1. All columns relating to AAPL.

In [21]:
df2010.loc[(df2010.loc[:, 'symb'] == 'AAPL'), :]

        symb    retdate      opn     high      low      cls       vol    exch
2       AAPL 2010-04-07  34.2457  34.5600  34.0943  34.3714  22446400  NASDAQ
1413    AAPL 2010-04-13  34.5514  34.6857  34.4443  34.6329  10936000  NASDAQ
2826    AAPL 2010-06-11  35.4614  36.2657  35.3386  36.2157  19491400  NASDAQ
4260    AAPL 2010-11-23  44.3500  44.5357  43.7943  44.1043  18551600  NASDAQ
5738    AAPL 2010-02-01  27.4814  28.0000  27.3286  27.8186  26781200  NASDAQ
...      ...        ...      ...      ...      ...      ...       ...     ...
355044  AAPL 2010-11-12  45.1429  45.2143  43.3757  44.0043  28423000  NASDAQ
356518  AAPL 2010-02-24  28.3186  28.7771  28.2629  28.6657  16448700  NASDAQ
357917  AAPL 2010-08-13  35.9500  35.9829  35.5843  35.5857  12673800  NASDAQ
359368  AAPL 2010-06-08  36.1771  36.2571  35.0929  35.6186  35741700  NASDAQ
360802  AAPL 2010-04-22  36.8914  38.1071  36.6000  38.0671  28336500  NASDAQ

[252 rows x 8 columns]

2. All columns from the table and a column with the difference between open and close (open - close) for AAPL on the 7th of January.

In [25]:
df2010.loc[(df2010.loc[:, 'symb'] == 'AAPL') & (df2010.loc[:, 'retdate'] == '2010-01-07'), :].assign(diff = df2010.loc[:, 'opn']-df2010.loc[:, 'cls'])

,symb,retdate,opn,high,low,cls,vol,exch,diff
155006,AAPL,2010-01-07,30.25,30.2857,29.8643,30.0829,17040300,NASDAQ,0.1671

3. Write a query which returns the stock symbol, the date, the open and close price for the top five dfferences (open - close) in 2010 for only those stocks on the New York Stock Exchange (NYSE).

In [34]:
temp = df2010.copy().assign(diff = (df2010.loc[:, 'opn']-df2010.loc[:, 'cls']))
temp.loc[(temp.loc[:, 'exch'] == 'NYSE'), ['symb', 'retdate', 'opn', 'cls', 'diff']].nlargest(5, ['diff']).drop(columns = ['diff'])

         symb    retdate       opn       cls
729747  BRK.A 2010-01-22  109720.0  105000.0
814544  BRK.A 2010-01-25  107400.0  103200.0
501006  BRK.A 2010-02-01  116640.0  113138.0
789262  BRK.A 2010-01-26  104800.0  101751.0
481255  BRK.A 2010-07-16  118800.0  115815.0

4. The days when AAPL has a volume more than 20 million and where the high is $3 or more dollars greater than the low. Write it twice, once to return a series and once as a dataFrame.

In [35]:
df2010.loc[(df2010.loc[:, 'symb'] == 'AAPL') & (df2010.loc[:, 'vol'] > 20000000) & (df2010.loc[:, 'high'] > df2010.loc[:, 'low'] + 3), 'retdate']

121881   2010-05-07
126158   2010-05-06
Name: retdate, dtype: datetime64[ns]

In [36]:
df2010.loc[(df2010.loc[:, 'symb'] == 'AAPL') & (df2010.loc[:, 'vol'] > 20000000) & (df2010.loc[:, 'high'] > df2010.loc[:, 'low'] + 3), ['retdate']]

          retdate
121881 2010-05-07
126158 2010-05-06

5. Write a query which returns 3 columns: the return date, SYMB and volume, but only for stocks that have a volume larger than 200 million

In [37]:
df2010.loc[(df2010.loc[:, 'vol'] > 200000000), ['retdate', 'symb', 'vol']]

          retdate  symb        vol
1179   2010-04-07  SIRI  609834400
2593   2010-04-13  SIRI  205387400
29792  2010-04-05  SIRI  237218700
31208  2010-04-15  SIRI  252020000
32620  2010-04-01  SIRI  225720900
...           ...   ...        ...
792762 2010-03-26   BAC  220970600
796356 2010-05-20   BAC  301264100
803582 2010-05-21   BAC  266468400
810771 2010-12-07   BAC  215071500
814443 2010-01-25   BAC  262351400

[139 rows x 3 columns]

# Main Problems

1. Write a query which returns all information about about Google (GOOG), NetFlix (NFLX), Amazon (AMZN) and Microsoft (MSFT) in 2010.

In [38]:
df2010.loc[(df2010.loc[:, 'symb'] == 'GOOG') | (df2010.loc[:, 'symb'] == 'NFLX') | (df2010.loc[:, 'symb'] == 'AMZN') | (df2010.loc[:, 'symb'] == 'MSFT'), :]

,symb,retdate,opn,high,low,cls,vol,exch
81,AMZN,2010-04-07,135.9600,136.0800,133.8600,134.8700,5947200,NASDAQ
569,GOOG,2010-04-07,283.6500,284.3750,280.9300,281.7700,2581000,NASDAQ
872,MSFT,2010-04-07,29.1600,29.5600,29.1400,29.3500,58320500,NASDAQ
904,NFLX,2010-04-07,11.7271,11.7671,11.3143,11.3900,3602100,NASDAQ
1492,AMZN,2010-04-13,141.2300,141.9800,139.1200,140.1600,4787000,NASDAQ
...,...,...,...,...,...,...,...,...
360288,NFLX,2010-06-08,15.8671,16.0714,15.3286,15.7614,3446000,NASDAQ
360882,AMZN,2010-04-22,147.0100,151.0900,145.8800,150.0900,15165700,NASDAQ
361375,GOOG,2010-04-22,276.0000,276.2500,271.6750,273.5300,3283600,NASDAQ
361680,MSFT,2010-04-22,31.0400,31.5300,30.9000,31.3900,84847500,NASDAQ
361712,NFLX,2010-04-22,13.0000,14.6414,12.9500,14.3214,12926400,NASDAQ

2. Write a query which returns the date and symbol of the largest “one-day gainer”, that is the stock which has the highest close - open on the NYSE.

In [44]:
df2010.loc[(df2010.loc[:, 'exch'] == 'NYSE'), :].assign(diff = df2010.loc[:, 'cls']-df2010.loc[:, 'opn']).nlargest(1, ['diff']).loc[:, ['retdate', 'symb']]

          retdate   symb
720705 2010-01-20  BRK.A